<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
  <dict>
    <key>PayloadContent</key>
    <array>
      <!-- Privacy Permissions: Full Disk Access & Bluetooth Control -->
      <dict>
        <key>PayloadType</key>
        <string>com.apple.TCC.configuration-profile-policy</string>
        <key>PayloadIdentifier</key>
        <string>com.sentinelone.fda-bt</string>
        <key>PayloadUUID</key>
        <string>H1I2J3K4-L5M6-N7O8-P9Q0-R1S2T3U4V5W6</string>
        <key>Services</key>
        <dict>
          <key>SystemPolicyAllFiles</key>
          <array>
            <dict>
              <key>Authorization</key>
              <string>Allow</string>
              <key>Identifier</key>
              <string>com.sentinelone.sentineld</string>
              <key>IdentifierType</key>
              <string>bundleID</string>
              <key>CodeRequirement</key>
              <string>anchor apple generic and identifier "com.sentinelone.sentineld" and (certificate leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "4AYE5J54KN")</string>
              <key>StaticCode</key>
              <false/>
            </dict>
            <dict>
              <key>Authorization</key>
              <string>Allow</string>
              <key>Identifier</key>
              <string>com.sentinelone.sentineld-helper</string>
              <key>IdentifierType</key>
              <string>bundleID</string>
              <key>CodeRequirement</key>
              <string>anchor apple generic and identifier "com.sentinelone.sentineld-helper" and (certificate leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "4AYE5J54KN")</string>
              <key>StaticCode</key>
              <false/>
            </dict>
            <dict>
              <key>Authorization</key>
              <string>Allow</string>
              <key>Identifier</key>
              <string>com.sentinelone.sentineld-shell</string>
              <key>IdentifierType</key>
              <string>bundleID</string>
              <key>CodeRequirement</key>
              <string>anchor apple generic and identifier "com.sentinelone.sentineld-shell" and (certificate leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "4AYE5J54KN")</string>
              <key>StaticCode</key>
              <false/>
            </dict>
          </array>
          <key>BluetoothAlways</key>
          <array>
            <dict>
              <key>Allowed</key>
              <true/>
              <key>Identifier</key>
              <string>com.sentinelone.sentinel-helper</string>
              <key>IdentifierType</key>
              <string>bundleID</string>
              <key>CodeRequirement</key>
              <string>anchor apple generic and identifier "com.sentinelone.sentinel-helper" and (certificate leaf[field.1.2.840.113635.100.6.1.9] /* exists */ or certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "4AYE5J54KN")</string>
              <key>StaticCode</key>
              <false/>
            </dict>
          </array>
        </dict>
        <key>PayloadVersion</key>
        <integer>1</integer>
      </dict>
      <!-- Notifications -->
      <dict>
        <key>PayloadType</key>
        <string>com.apple.notificationsettings</string>
        <key>PayloadUUID</key>
        <string>X7Y8Z9A0-B1C2-D3E4-F5G6-H7I8J9K0L1M2</string>
        <key>PayloadIdentifier</key>
        <string>com.sentinelOne.agentNotifications</string>
        <key>NotificationSettings</key>
        <array>
          <dict>
            <key>BundleIdentifier</key>
            <string>com.sentinelOne.SentinelAgent</string>
            <key>NotificationsEnabled</key>
            <true/>
            <key>AlertType</key>
            <integer>1</integer>
            <key>ShowInNotificationCenter</key>
            <true/>
            <key>ShowInLockScreen</key>
            <true/>
            <key>CriticalAlertEnabled</key>
            <true/>
            <key>SoundsEnabled</key>
            <true/>
            <key>BadgeAppIcon</key>
            <true/>
            <key>ShowPreview</key>
            <string>1</string>
          </dict>
        </array>
        <key>PayloadVersion</key>
        <real>1</real>
      </dict>
    </array>
    <key>PayloadScope</key>
    <string>System</string>
    <key>PayloadType</key>
    <string>Configuration</string>
    <key>PayloadRemovalDisallowed</key>
    <true/>
    <key>PayloadUUID</key>
    <string>N3O4P5Q6-R7S8-T9U0-V1W2-X3Y4Z5A6B7C8</string>
    <key>PayloadIdentifier</key>
    <string>com.sentinelone.S1ProfileToRuleThemAll</string>
    <key>PayloadDisplayName</key>
    <string>SentinelOne Agent 'One Profile'</string>
    <key>PayloadOrganization</key>
    <string>SentinelOne</string>
    <key>PayloadDescription</key>
    <string>Single Payload Designed to Configure the SentinelOne Agent for macOS</string>
    <key>PayloadVersion</key>
    <integer>1</integer>
  </dict>
</plist>
